/*******************************************************************************************************************************
Copyright (C) wuhanbai。All rights reserved.
********************************************************************************************************************************/
/******************************** Problem ************************************
                Check out readme.txt for the problem.
******************************************************************************/
/***************************** Include Files *********************************/
/************************** Constant Definitions *****************************/
/************************** Global Definitions *******************************/
/************************** Function Prototypes ******************************/
/************************** Function Definitions *****************************/
/******************************************************************************
*
* 输入一个数组获得最大利润
*
* @param	prices is data source.
*
* @param	prices_size is length.
*
* @return	profit is max profit.
*
* @note		None.
*
****************************************************************************/
int max_profit(int* prices, int prices_size)
{
    int *src = &prices[0], *tmp1 =&prices[0], *tmp2 = &prices[1], i = 0;
    int profit = 0;
    int j = prices_size - 1,k = prices_size - 2;
    for(i = 0; i < j; i++)
    {
        if(*tmp1 <= *tmp2)
        {
            if(i == k)
            {
                profit += *tmp2 -*src;
                break;
            }
            else
            {
                tmp1++;
                tmp2++;
            }
        }
        else
        {
            profit += (*tmp1 - *src);
            src = tmp2;
            tmp1 = tmp2;
            tmp2++;
        }
    }
    return profit;
}